# LeadingSpaces Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionEqualityLabelFormatting..::..LeadingSpaces Property
DimensionEqualityLabelFormatting Class See Also
---
The number of spaces to include before the parameter value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public int LeadingSpaces { get; set; }
```

Visual Basic
---
```text
Public Property LeadingSpaces As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int LeadingSpaces {
	int get ();
	void set (int value);
}
```

# See Also
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace